{
    "intents": [{
            "tag": "cancelar reserva",
            "patterns": [
                "cancelar reserva",
                "modificar reserva"
            ],
            "responses": [
                "¿Puedo cancelar o modificar una reserva de hotel? Sí, sí puedes.Pero ten en cuenta que dicha anulación puede conllevar unos gastos de cancelación.Al realizar la reserva, se informa de la política de cancelación, o bien ésta figura en las condiciones generales."
            ]
        },
        {
            "tag": "gastos reserva",
            "patterns": [
                "gastos cancelar reserva",
                "gastos modificar reserva"
            ],
            "responses": [
                "¿Qué gastos puede generar una cancelación o modificación de reserva ? Estos gastos de cancelación son variables según el destino, el proveedor, la tarifa reservada y las fechas de antelación a la anulación. Para anular o modificar una reserva, se puede mandar un e - mail a través del apartado CONTACTO, a través del apartado MIS RESERVAS, o llamando directamente al#########.,"
            ]
        },
        {
            "tag": "confirmar reserva",
            "patterns": [
                "confirmar reserva",
                "confirmarcion de reserva"
            ],
            "responses": [
                "¿Cómo sé si mi reserva de hotel se ha confirmado con éxito? Una vez finalizado el proceso de compra, aparecerá en tu pantalla un número de localizador y recibirás un e-mail con el estado de la reserva (confirmada o pendiente de confirmar). También puedes comprobar el estado en el apartado de MIS RESERVAS. Deberás revisar tu correo electrónico en las 24/48 horas siguientes al momento de la compra para comprobar que te ha llegado el e-mail de confirmación junto con el bono que deberás presentar en el establecimiento."
            ]
        },
        {
            "tag": "comida",
            "patterns": [
                "servicio a la habitacion",
                "almuerzo",
                "desayuno",
                "cena",
                "buffet",
                "régimen alimenticio",
                "SA, AD, MP, PC, TI, SP, HM"
            ],
            "responses": [
                "¿Qué significa SA, AD, MP, PC, TI, SP, HM en el bono del hotel? Estas siglas indican el régimen alimenticio contratado: SA : Sólo alojamiento. AD o HD: alojamiento y desayuno. MP: Media pensión, es decir desayuno y generalmente la cena. PC: Pensión completa, es decir desayuno, almuerzo y cena. TI: Todo incluido, es decir los servicios de PC más los especificados en cada caso. SP: Según programa (a consultar con el propio hotel). HM: Primer día sólo alojamiento, segundo día media pensión y el tercero desayuno (Esta combinación suele darse en paquetes de nieve o escapadas de fin de semana: viernes a domingo). Las bebidas no están incluidas en los precios salvo indicación expresa en cada hotel."
            ]
        },
        {
            "tag": "error de reserva",
            "patterns": [
                "reserva fallida",
                "error de reserva"
            ],
            "responses": [
                "¿Si ocurre algún error en el proceso de reserva se confirma igualmente la reserva de hotel? Si al final del proceso de reserva te apareciera un mensaje de error debes ponerte en contacto con nosotros a través del apartado de CONTACTO o llamando al ### ###### para verificar el estado de la reserva. Puede que haya ocurrido un error en la transacción de pago con el banco, y la reserva se haya realizado como si no. Nuestros agentes intentarán confirmarte en línea la confirmación o no de la reserva, y en caso contrario deberás verificar con tu banco si ha habido algún movimiento monetario en la cuenta."
            ]
        },
        {
            "tag": "horario",
            "patterns": [
                "horario entrada",
                "horario salida"
            ],
            "responses": [
                "¿Cuál es el horario habitual para la entrada y salida en los hoteles? Como norma general las habitaciones podrán ser utilizadas a partir de las 14 horas del día de llegada y deberán quedar libres antes de las 12 horas del día de salida. Ciertos hoteles podrás permitir la entrada antes del horario previsto, así como la salida varias horas después... pero teniendo en cuenta que dependerá de la política establecida por el mismo hotel.  ¿Tengo que avisar al hotel si preveo llegar más tarde de las 18.00 hrs? Es necesario que avises directamente al hotel (en el bono figura el número de teléfono) de la hora prevista de tu llegada, ya que en caso contrario pueden poner a disposición de otros clientes la habitación."
            ]
        },
        {
            "tag": "niños",
            "patterns": [
                "niños",
                "bebes",
                "infantes",
                "menores"
            ],
            "responses": [
                "¿Tengo que añadir a los niños o bebés en la reserva ? Sí, es necesario incluir a todos los pasajeros.Por pasajero se entiende toda aquella persona física que vaya a acudir al hotel reservado, indistintamente de que sea bebé, niño o adulto. El proveedor o el hotel tienen que tener una previsión de las personas y edades de los ocupantes, puesto que hay algunos tipos de habitación en las cuales no caben una cama extra o cuna.",
                "¿Cómo se añaden los niños o bebés en una reserva? Se tienen que indicar como una persona más, indicando la edad que tendrá el niño/bebé cuando se inicien los servicios de la reserva. Si el bebé tiene sólo meses, hay que indicar la edad de 1 año (que hará referencia a todos aquellos bebés desde 1 día hasta 24 meses). En el caso de los niños, deberá indicarse la edad correspondiente.",
                "¿Cómo solicito una cuna o una habitación con características especiales? En el caso que requieras un servicio especial (cuna, comida sin gluten, cama matrimonial, habitación para fumadores, etc) deberás solicitarlo por e-mail indicando el localizador de la reserva o a través del 902 366847. Todos estos servicios pueden llevar un cargo adicional y están sujetos a disponibilidad."

            ]
        },
        {
            "tag": "habitaciones",
            "patterns": [
                "habitacion",
                "habitaciones",
                "habitaciones dobles"
            ],
            "responses": [
                "¿Qué diferencia hay entre una habitación doble y una habitación doble con 2 camas? La diferencia está en que una habitación doble se trata de una habitación estándar que tiene una cama doble, mientras que una habitación doble con 2 camas cuenta con dos camas individuales. Si se trata de una habitación doble, 1 o 2 camas, puede referirse a cualquiera de las dos opciones anteriores.",
                "¿Cuántas habitaciones máximo puedo reservar ?: * ",
                "Mi habitación, ¿será exacta a la fotografía que se me muestra en la descripción del hotel en la web? Las fotos de las habitaciones de hotel que aparecen en la web solo son para dar una idea general. Ha de tener en cuenta que el tamaño, el estilo, mobiliario y servicios pueden variar."

            ]
        },
        {
            "tag": "condiciones generales",
            "patterns": [
                "condiciones generales",
                "condiciones reservas"
            ],
            "responses": [
                "¿Cuáles son las condiciones generales en las reservas de hoteles? Las Condiciones Generales de Hoteles aparecen escritas en nuestra página web en el proceso de reserva. Deberás leerlas y aceptarlas para poder finalizar la compra. En caso de tener cualquier duda al respecto te rogamos nos consultes antes de confirmar tu reserva"
            ]
        },
        {
            "tag": "reservar",
            "patterns": [
                "hacer reserva",
                "reservar habitacion",
                "pagar reserva"
            ],
            "responses": [
                "¿Cómo puedo pagar una reserva de hotel? Al finalizar la reserva te mostraremos las diferentes formas de pago de la reserva. Puedes pagar mediante tarjeta de crédito, de débito, transferencia online, transferencia bancaria, paypal... En ocasiones y según la antelación con que hagas la reserva, no todas estas opciones estarán disponibles. Normalmente abonarás el 25% a la hora de realizar la reserva y el importe restante 30 días antes de la entrada al hotel. En ocasiones podrás beneficiarte de promociones especiales las cuales puedan modificar los importes y fechas de pago, los cuales siempre te figurarán indicados en la web. En el caso de que la reserva de hotel sea de pago directamente en el hotel, la cual vendrá claramente indicada como tal en la reserva, se pedirán los datos de tarjeta de crédito únicamente como garantía. En el hotel puedes pagar con la misma tarjeta, con una diferente o en efectivo... Eso sí, si se trata de una tarifa no reembolsable el hotel te cargará directamente el importe de tu reserva."
            ]
        },
        {
            "tag": "email de reserva",
            "patterns": [
                "email de confirmacion",
                "no recibir confirmacion"
            ],
            "responses": [
                "Qué hago si no recibo el e-mail de confirmación de reserva de hotel ? Podría ser que el e - mail enviado por Eurobuilding estuviera en tu bandeja de correo no deseado. En cualquier caso, si se te ha confirmado tu reserva en pantalla y te hemos dado un localizador, puedes acceder a los detalles de tu reserva y al bono a través de Mis Reservas: También puedes ponerte en contacto con nosotros a través del apartado CONTACTO para confirmar los datos de tu reserva."
            ]
        },
        {
            "tag": "como reservar",
            "patterns": [
                "como reservo un hotel",
                "como reservar un hotel"
            ],
            "responses": [
                "¿Como reservo un hotel? *"
            ]
        },
        {
            "tag": "email de reserva",
            "patterns": [
                "email de confirmacion",
                "no recibir confirmacion"
            ],
            "responses": [
                "Qué hago si no recibo el e-mail de confirmación de reserva de hotel ? Podría ser que el e - mail enviado por Eurobuilding estuviera en tu bandeja de correo no deseado. En cualquier caso, si se te ha confirmado tu reserva en pantalla y te hemos dado un localizador, puedes acceder a los detalles de tu reserva y al bono a través de Mis Reservas: También puedes ponerte en contacto con nosotros a través del apartado CONTACTO para confirmar los datos de tu reserva."
            ]
        },
        {
            "tag": "ecotasa",
            "patterns": [
                "ecotasa",
                "tasa turistica",
                "impuestos"
            ],
            "responses": [
                "¿Qué es la ECOTASA o TASA TURÍSTICA? La ECOTASA es un impuesto o tasa turística que emplean algunos organismos públicos (ayuntamientos, comunidades autónomas, regiones, etc) como fuente de financiación destinada a la promoción turística o a la preservación del medio ambiente. En el precio de las reservas efectuadas a través de nuestra web no está incluida la ecotasa, ya que el pago de la misma se exige en los hoteles de algunas zonas turísticas, variando el importe de una a otra zona y en función de los días de estancia."
            ]
        },
        {
            "tag": "alojamiento",
            "patterns": [
                "incluye el precio de reserva",
                "reserva de hotel",
                "paquete de reserva"
            ],
            "responses": [
                "¿Qué incluye el precio de una reserva de hotel? El precio incluye el alojamiento en el establecimiento para los pasajeros y según tipo de acomodación y régimen alimenticio que figura en la documentación;  además de los impuestos IVA, IGIC."
            ]
        },
        {
            "tag": "constancia",
            "patterns": [
                "no hay constancia de mi reserva",
                "no encuentran mi reserva",
                "error de reservacion"
            ],
            "responses": [
                "¿Qué hago si en el hotel contratado no hay constancia de mi reserva? Debes ponerte en contacto con nosotros a través del teléfono que te viene indicado de asistencia en viaje, junto al bono del hotel, para verificar el estado de tu reserva. Si confirmamos que tienes una reserva, haremos las gestiones oportunas con el proveedor para resolver la posible incidencia y te informaremos con la mayor brevedad posible."
            ]
        },
        {
            "tag": "reservar para otros",
            "patterns": [
                "como reservo un hotel para otra persona",
                "reservar para otros"
            ],
            "responses": [
                "¿Cómo realizo una reserva de hotel para otra persona? Al introducir los datos de la reserva, en el campo titular colocarás el nombre de la persona que se alojará en el hotel."
            ]
        },
        {
            "tag": "encontrar hotel",
            "patterns": [
                "como encuentro un hotel en especifico",
                "como buscar un hotel"
            ],
            "responses": [
                "¿Cómo encuentro un hotel en concreto? *"
            ]
        },
        {
            "tag": "estancia",
            "patterns": [
                "puedo ampliar la estancia",
                "puedo reducir la estancia",
                "añadir mas dias a mi estancia"
            ],
            "responses": [
                "¿Puedo ampliar o reducir la estancia en el hotel una vez en destino? Sí es posible, pero siempre teniendo en cuenta que: En caso de abandonar el hotel antes de la fecha prevista. Aconsejamos solicitar al hotel un escrito formal notificando la no facturación de los días no disfrutados y remitirnos una copia para su gestión. En caso de ampliar la estancia una vez ya en destino, contacta con nosotros y te informaremos sobre la disponibilidad y tarifa del hotel. Deberás realizar el pago de la ampliación de la estancia mediante tarjeta de crédito."
            ]
        },
        {
            "tag": "contacto",
            "patterns": [
                "como encuentro un hotel en especifico",
                "como buscar un hotel"
            ],
            "responses": [
                "¿Dónde puedo encontrar el número del teléfono del hotel y/o su dirección de e-mail?"
            ]
        },
        {
            "tag": "encontrar hotel",
            "patterns": [
                "como encuentro un hotel en especifico",
                "como buscar un hotel"
            ],
            "responses": [
                "¿Cómo encuentro un hotel en concreto? *"
            ]
        },
        {
            "tag": "mascotas",
            "patterns": [
                "aceptan mascotas",
                "puedo llevar a mi perro",
                "puedo llevar a mi gato",
                "y si tengo un leon"
            ],
            "responses": [
                "¿Puedo alojarme en un hotel con mi mascota? Por supuesto, en ##### sabemos lo importante que son estos pequeños amigos para ti. Por lo tanto, no habrá problema si llevas a tu mascota."
            ]
        },
        {
            "tag": "documentacion",
            "patterns": [
                "debo mostrar mi pasaporte",
                "necesitan mi dni",
                "documentacion necesaria para alojarme",
                "documentos necesarios para la reserva"
            ],
            "responses": [
                "¿Qué documentación debo presentar a mi entrada al hotel? Cuando has realizado la reserva te enviamos una confirmación de la misma, con todos los servicios detallados. Si has pagado el 100% de la reserva, te llegará el correspondiente bono por correo electrónico, que será el documento que deberás imprimir y presentar a tu entrada al hotel. No es necesario presentar facturas ni ningún otro documento, ya que lo que exige el hotel es dicho bono, junto al DNI o pasaportes de los titulares de la reserva."
            ]
        },
        {
            "tag": "encontrar hotel",
            "patterns": [
                "como encuentro un hotel en especifico",
                "como buscar un hotel"
            ],
            "responses": [
                "¿Cómo encuentro un hotel en concreto? *"
            ]
        },
        {
            "tag": "instalaciones",
            "patterns": [
                "areas comunes",
                "instalaciones del hotel",
                "piscina",
                "ginmnasio",
                "bar",
                "buffet",
                "lobbie"
            ],
            "responses": [
                "¿Cómo puedo saber las instalaciones con las que cuenta el hotel ? *"
            ]
        },
        {
            "tag": "pago reserva",
            "patterns": [
                "pagar reserva",
                "pago completo",
                "pagar al reservar"
            ],
            "responses": [
                "¿Cuándo he de pagar la reserva de hotel? Siempre se paga el 100% al realizar la reserva, no importa la antelación con que se haga de la misma."
            ]
        },
        {
            "tag": "hotel lleno",
            "patterns": [
                "overbooking",
                "no hay habitaciones disponibles",
                "hotel lleno",
                "ginmnasio",
                "bar",
                "buffet",
                "lobbie"
            ],
            "responses": [
                "¿Qué pasa si cuando llego al hotel me indican que hay overbooking, es decir, que no hay habitaciones disponibles? En caso de que al llegar al hotel le indicaran que no hay habitaciones disponibles, le daremos una alternativa en otro hotel de la misma categoría y en la misma pensión contratada originalmente. Esto raramente ocurre, pero puede pasar. Ante cualquier problema le recomendamos que nos contacte para que se lo podamos solucionar lo antes posible."
            ]
        },
        {
            "tag": "opiniones",
            "patterns": [
                "puedo recomendar el hotel",
                "puedo hacer opinar del hotel",
                "dejar una recomendacion",
                "dejar opinion",
                "comentarios del hotel"
            ],
            "responses": [
                "¿Puedo opinar sobre un hotel? *",
                "Dónde puedo ver las opiniones de clientes sobre un hotel ? * ",
                "¿Me contactará alguien una vez haya les haya enviado un comentario sobre un hotel? Dependiendo de sus comentarios podría ocurrir que nos pusiéramos en contacto con usted para que nos diera más información sobre la situación comentada."
            ]
        },
        {
            "tag": "reserva rapida",
            "patterns": [
                "reservas para el mismo dia",
                "reservas de ultimo momento"
            ],
            "responses": [
                "¿Puedo realizar reservas para el mismo día? Sí, tan solo deberás realizar la búsqueda en la página web, realizar el pago total y te enviaremos el bono que debes entregar... cuando llegues al hotel tu habitación estará lista."
            ]
        },
        {
            "tag": "edad de reserva",
            "patterns": [
                "edad minima para reservar",
                "reservas de ultimo momento"
            ],
            "responses": [
                "¿Cuál es la edad mínima para poder reservar un hotel? Para reservar un hotel a través de nuestra página web, debe tener como mínimo 18 años (21 años en EE.UU) El hotel puede negar la admisión de un grupo de personas que viajan juntas si no hay por lo menos un adulto con 18 años cumplidos (21 en el caso de EE.UU). En este caso Eurobuilding no acepta ningún tipo de responsabilidad."
            ]
        },
        {
            "tag": "transporte",
            "patterns": [
                "traslado al hotel",
                "traslado desde el hotel",
                "transporte",
                "servicio de taxis"
            ],
            "responses": [
                "¿Cómo puedo saber si el hotel ofrece servicio de traslados y cómo he de contratarlo? Si el hotel ofrece servicio de traslados lo verás reflejado en nuestra página web. Cuando hayas realizado en firme la reserva deberás ponerte en contacto con el hotel para solicitar dicho servicio, puede que te soliciten los datos del vuelo."
            ]
        },
        {
            "tag": "parking",
            "patterns": [
                "servicio de parking",
                "servicios",
                "parking"
            ],
            "responses": [
                "¿Qué he de hacer si quiero contratar el servicio de parking del hotel ? Una vez tengas realizada la reserva deberás ponerte en contacto directamente con el hotel con los datos que te aparecerán en el bono, y abonar el importe correspondiente en destino."
            ]
        },
        {
            "tag": "ambientacion",
            "patterns": [
                "aire acondicionado",
                "calefaccion"
            ],
            "responses": [
                "¿Estará disponible el aire acondicionado o la calefacción en el hotel? Si, por supuesto en Eurobuilding ofrecemos el mejor servicio."
            ]
        }, {
            "tag": "pandemia",
            "patterns": [
                "covid19",
                "COVID",
                "pandemia",
                "bioseguridad",
                "coronavirus"
            ],
            "responses": [
                "¿Cómo afecta el Coronavirus a mi reserva de hotel? Estamos aplicando condiciones flexibles de modificación y cancelación de las reservas activas cuyo origen o destino coincida con zonas afectadas. Estamos en constante contacto con los hoteles para conocer las políticas aplicables tanto a las reservas activas como a las futuras. Para las nuevas reservas, se pueden cancelar sin gastos adicionales hasta 30 días antes del inicio de la estancia en las opciones de alojamiento que así lo indiquen durante el proceso de reserva.",
                "¿Qué medidas de bioseguridad está tomando la cadena hotelera? Estamos tomando medidas para la prevención del COVID-19 en nuestros establecimientos y garantizar la seguridad de nuestros huéspedes. A continuación, encontrarás los protocolos y normas que estamos implementando: - Formación en normas de higiene y salud alimentaria a los empleados. - Equipos de protección individual y de higiene específicos para los trabajadores. - Check-in digital y fast check-out para evitar aglomeraciones y tiempos de espera en la recepción - Limpieza y desinfección constante tanto de zonas comunes como de las habitaciones.  - Nuevo sistema de señalética para informar sobre las medidas de prevención y marcar la distancia a mantener entre personas. - Colocación de dispensadores de gel hidroalcohólico en las zonas comunes. - Reducción de aforos en restaurantes, bares, piscinas y otras zonas comunes. - Sistema de reserva previa de hamacas para la zona de piscinas. - Minibar a la carta. Se eliminan las amenities y el minibar de las habitaciones y este funciona bajo petición."
            ]
        }

    ]
}