{
    "intents": [{
            "tag": "greeting",
            "patterns": [
                "Hola",
                "Hey",
                "Como estas?",
                "Hay alguien aqui?",
                "Que tal?",
                "Buen dia"
            ],
            "responses": [
                "Hey :-)",
                "Hola, gracias por la visita",
                "Hola aqui, que puedo hacer por ti?",
                "Hola aqui, como puedo ayudarte?"
            ]
        },
        {
            "tag": "goodbye",
            "patterns": ["Chao", "Nos vemos despues", "Adios"],
            "responses": [
                "Nos vemos despues, gracias por la visita",
                "Ten un buen dia!",
                "Chao! Regresa pronto."
            ]
        },
        {
            "tag": "thanks",
            "patterns": ["Thanks", "Gracias", "Muchisimas gracias", "Muchas gracias"],
            "responses": ["Feliz de ayudarte!", "Cuando quieras!", "Es un placer ayudarte!"]
        },
        {
            "tag": "cancel",
            "patterns": [
                "puedo cancelar la reservacion?",
                "Puedo modificar la resevacion?",
                "Donde puedo modificar la resevacion?"
            ],
            "responses": [
                "Sí, sí puedes. Pero ten en cuenta que dicha anulación puede conllevar unos gastos de cancelación. Al realizar la reserva, se informa de la política de cancelación, o bien ésta figura en las condiciones generales.",
                "Estos gastos de cancelación son variables según el destino, el proveedor, la tarifa reservada y las fechas de antelación a la anulación. Para anular o modificar una reserva, se puede mandar un e - mail a través del apartado CONTACTO, a través del apartado MIS RESERVAS, o llamando directamente al#########."
            ]
        },
        {
            "tag": "confirmation",
            "patterns": [
                "Donde confirmo mi reserva?",
                "Como puedo confirmar la reserva?",
                "Donde hago la confirmacion de reserva?",
                "Llegara confirmacion de reserva?",
                "¿Cómo sé si mi reserva de hotel se ha confirmado con éxito?"
            ],
            "responses": [
                "Una vez finalizado el proceso de compra, aparecerá en tu pantalla un número de localizador y recibirás un e-mail con el estado de la reserva confirmada o pendiente de confirmar. También puedes comprobar el estado en el apartado de MIS RESERVAS. Deberás revisar tu correo electrónico en las 24/48 horas siguientes al momento de la compra para comprobar que te ha llegado el e-mail de confirmación junto con el bono que deberás presentar en el establecimiento."
            ]
        },
        {
            "tag": "horario",
            "patterns": [
                "¿Cuál es el horario habitual para la entrada y salida en los hoteles?",
                "Cual es el horario del hotel?",
                "A que hora puedo llegar al hotel?",
                "¿Tengo que avisar al hotel si preveo llegar más tarde de las 18.00 hrs ? "
            ],
            "responses": [
                "Como norma general las habitaciones podrán ser utilizadas a partir de las 14 horas del día de llegada y deberán quedar libres antes de las 12 horas del día de salida. Ciertos hoteles podrás permitir la entrada antes del horario previsto, así como la salida varias horas después... pero teniendo en cuenta que dependerá de la política establecida por el mismo hotel. ",
                "Es necesario que avises directamente al hotel. En el bono figura el número de teléfono, de la hora prevista de tu llegada, ya que en caso contrario pueden poner a disposición de otros clientes la habitación."
            ]
        },
        {
            "tag": "kids",
            "patterns": [
                "¿Tengo que añadir a los niños o bebés en la reserva?",
                "¿Cómo se añaden los niños o bebés en una reserva?",
                "¿Cómo solicito una cuna o una habitación con características especiales? "
            ],
            "responses": [
                " Sí, es necesario incluir a todos los pasajeros.Por pasajero se entiende toda aquella persona física que vaya a acudir al hotel reservado, indistintamente de que sea bebé, niño o adulto. El proveedor o el hotel tienen que tener una previsión de las personas y edades de los ocupantes, puesto que hay algunos tipos de habitación en las cuales no caben una cama extra o cuna.",
                " Se tienen que indicar como una persona más, indicando la edad que tendrá el niño/bebé cuando se inicien los servicios de la reserva. Si el bebé tiene sólo meses, hay que indicar la edad de 1 año que hará referencia a todos aquellos bebés desde 1 día hasta 24 meses. En el caso de los niños, deberá indicarse la edad correspondiente.",
                "En el caso que requieras un servicio especial: cuna, comida sin gluten, cama matrimonial, habitación para fumadores, etc; deberás solicitarlo por e-mail indicando el localizador de la reserva o a través del 902 366847. Todos estos servicios pueden llevar un cargo adicional y están sujetos a disponibilidad."
            ]
        }
    ]
}